###################################################################

# Created by write_sdc on Tue Apr  9 22:28:10 2024

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 4 [current_design]
set_max_capacitance 0.005 [get_ports clk_i]
set_max_capacitance 0.005 [get_ports rst_ni]
set_max_capacitance 0.005 [get_ports test_en_i]
set_max_capacitance 0.005 [get_ports {ram_cfg_i[9]}]
set_max_capacitance 0.005 [get_ports {ram_cfg_i[8]}]
set_max_capacitance 0.005 [get_ports {ram_cfg_i[7]}]
set_max_capacitance 0.005 [get_ports {ram_cfg_i[6]}]
set_max_capacitance 0.005 [get_ports {ram_cfg_i[5]}]
set_max_capacitance 0.005 [get_ports {ram_cfg_i[4]}]
set_max_capacitance 0.005 [get_ports {ram_cfg_i[3]}]
set_max_capacitance 0.005 [get_ports {ram_cfg_i[2]}]
set_max_capacitance 0.005 [get_ports {ram_cfg_i[1]}]
set_max_capacitance 0.005 [get_ports {ram_cfg_i[0]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[31]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[30]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[29]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[28]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[27]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[26]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[25]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[24]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[23]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[22]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[21]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[20]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[19]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[18]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[17]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[16]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[15]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[14]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[13]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[12]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[11]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[10]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[9]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[8]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[7]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[6]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[5]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[4]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[3]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[2]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[1]}]
set_max_capacitance 0.005 [get_ports {hart_id_i[0]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[31]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[30]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[29]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[28]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[27]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[26]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[25]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[24]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[23]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[22]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[21]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[20]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[19]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[18]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[17]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[16]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[15]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[14]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[13]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[12]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[11]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[10]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[9]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[8]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[7]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[6]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[5]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[4]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[3]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[2]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[1]}]
set_max_capacitance 0.005 [get_ports {boot_addr_i[0]}]
set_max_capacitance 0.005 [get_ports instr_gnt_i]
set_max_capacitance 0.005 [get_ports instr_rvalid_i]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[31]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[30]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[29]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[28]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[27]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[26]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[25]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[24]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[23]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[22]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[21]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[20]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[19]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[18]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[17]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[16]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[15]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[14]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[13]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[12]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[11]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[10]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[9]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[8]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[7]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[6]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[5]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[4]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[3]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[2]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[1]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_i[0]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_intg_i[6]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_intg_i[5]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_intg_i[4]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_intg_i[3]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_intg_i[2]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_intg_i[1]}]
set_max_capacitance 0.005 [get_ports {instr_rdata_intg_i[0]}]
set_max_capacitance 0.005 [get_ports instr_err_i]
set_max_capacitance 0.005 [get_ports data_gnt_i]
set_max_capacitance 0.005 [get_ports data_rvalid_i]
set_max_capacitance 0.005 [get_ports {data_rdata_i[31]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[30]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[29]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[28]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[27]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[26]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[25]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[24]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[23]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[22]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[21]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[20]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[19]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[18]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[17]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[16]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[15]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[14]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[13]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[12]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[11]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[10]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[9]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[8]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[7]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[6]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[5]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[4]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[3]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[2]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[1]}]
set_max_capacitance 0.005 [get_ports {data_rdata_i[0]}]
set_max_capacitance 0.005 [get_ports {data_rdata_intg_i[6]}]
set_max_capacitance 0.005 [get_ports {data_rdata_intg_i[5]}]
set_max_capacitance 0.005 [get_ports {data_rdata_intg_i[4]}]
set_max_capacitance 0.005 [get_ports {data_rdata_intg_i[3]}]
set_max_capacitance 0.005 [get_ports {data_rdata_intg_i[2]}]
set_max_capacitance 0.005 [get_ports {data_rdata_intg_i[1]}]
set_max_capacitance 0.005 [get_ports {data_rdata_intg_i[0]}]
set_max_capacitance 0.005 [get_ports data_err_i]
set_max_capacitance 0.005 [get_ports irq_software_i]
set_max_capacitance 0.005 [get_ports irq_timer_i]
set_max_capacitance 0.005 [get_ports irq_external_i]
set_max_capacitance 0.005 [get_ports {irq_fast_i[14]}]
set_max_capacitance 0.005 [get_ports {irq_fast_i[13]}]
set_max_capacitance 0.005 [get_ports {irq_fast_i[12]}]
set_max_capacitance 0.005 [get_ports {irq_fast_i[11]}]
set_max_capacitance 0.005 [get_ports {irq_fast_i[10]}]
set_max_capacitance 0.005 [get_ports {irq_fast_i[9]}]
set_max_capacitance 0.005 [get_ports {irq_fast_i[8]}]
set_max_capacitance 0.005 [get_ports {irq_fast_i[7]}]
set_max_capacitance 0.005 [get_ports {irq_fast_i[6]}]
set_max_capacitance 0.005 [get_ports {irq_fast_i[5]}]
set_max_capacitance 0.005 [get_ports {irq_fast_i[4]}]
set_max_capacitance 0.005 [get_ports {irq_fast_i[3]}]
set_max_capacitance 0.005 [get_ports {irq_fast_i[2]}]
set_max_capacitance 0.005 [get_ports {irq_fast_i[1]}]
set_max_capacitance 0.005 [get_ports {irq_fast_i[0]}]
set_max_capacitance 0.005 [get_ports irq_nm_i]
set_max_capacitance 0.005 [get_ports scramble_key_valid_i]
set_max_capacitance 0.005 [get_ports {scramble_key_i[127]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[126]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[125]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[124]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[123]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[122]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[121]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[120]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[119]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[118]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[117]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[116]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[115]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[114]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[113]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[112]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[111]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[110]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[109]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[108]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[107]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[106]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[105]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[104]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[103]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[102]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[101]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[100]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[99]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[98]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[97]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[96]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[95]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[94]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[93]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[92]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[91]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[90]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[89]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[88]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[87]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[86]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[85]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[84]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[83]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[82]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[81]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[80]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[79]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[78]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[77]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[76]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[75]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[74]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[73]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[72]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[71]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[70]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[69]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[68]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[67]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[66]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[65]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[64]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[63]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[62]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[61]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[60]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[59]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[58]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[57]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[56]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[55]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[54]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[53]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[52]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[51]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[50]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[49]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[48]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[47]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[46]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[45]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[44]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[43]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[42]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[41]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[40]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[39]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[38]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[37]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[36]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[35]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[34]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[33]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[32]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[31]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[30]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[29]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[28]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[27]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[26]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[25]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[24]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[23]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[22]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[21]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[20]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[19]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[18]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[17]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[16]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[15]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[14]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[13]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[12]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[11]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[10]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[9]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[8]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[7]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[6]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[5]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[4]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[3]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[2]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[1]}]
set_max_capacitance 0.005 [get_ports {scramble_key_i[0]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[63]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[62]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[61]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[60]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[59]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[58]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[57]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[56]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[55]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[54]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[53]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[52]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[51]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[50]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[49]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[48]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[47]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[46]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[45]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[44]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[43]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[42]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[41]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[40]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[39]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[38]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[37]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[36]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[35]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[34]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[33]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[32]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[31]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[30]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[29]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[28]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[27]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[26]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[25]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[24]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[23]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[22]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[21]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[20]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[19]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[18]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[17]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[16]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[15]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[14]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[13]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[12]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[11]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[10]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[9]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[8]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[7]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[6]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[5]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[4]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[3]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[2]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[1]}]
set_max_capacitance 0.005 [get_ports {scramble_nonce_i[0]}]
set_max_capacitance 0.005 [get_ports debug_req_i]
set_max_capacitance 0.005 [get_ports {fetch_enable_i[3]}]
set_max_capacitance 0.005 [get_ports {fetch_enable_i[2]}]
set_max_capacitance 0.005 [get_ports {fetch_enable_i[1]}]
set_max_capacitance 0.005 [get_ports {fetch_enable_i[0]}]
set_max_capacitance 0.005 [get_ports scan_rst_ni]
set_max_fanout 4 [get_ports clk_i]
set_max_fanout 4 [get_ports rst_ni]
set_max_fanout 4 [get_ports test_en_i]
set_max_fanout 4 [get_ports {ram_cfg_i[9]}]
set_max_fanout 4 [get_ports {ram_cfg_i[8]}]
set_max_fanout 4 [get_ports {ram_cfg_i[7]}]
set_max_fanout 4 [get_ports {ram_cfg_i[6]}]
set_max_fanout 4 [get_ports {ram_cfg_i[5]}]
set_max_fanout 4 [get_ports {ram_cfg_i[4]}]
set_max_fanout 4 [get_ports {ram_cfg_i[3]}]
set_max_fanout 4 [get_ports {ram_cfg_i[2]}]
set_max_fanout 4 [get_ports {ram_cfg_i[1]}]
set_max_fanout 4 [get_ports {ram_cfg_i[0]}]
set_max_fanout 4 [get_ports {hart_id_i[31]}]
set_max_fanout 4 [get_ports {hart_id_i[30]}]
set_max_fanout 4 [get_ports {hart_id_i[29]}]
set_max_fanout 4 [get_ports {hart_id_i[28]}]
set_max_fanout 4 [get_ports {hart_id_i[27]}]
set_max_fanout 4 [get_ports {hart_id_i[26]}]
set_max_fanout 4 [get_ports {hart_id_i[25]}]
set_max_fanout 4 [get_ports {hart_id_i[24]}]
set_max_fanout 4 [get_ports {hart_id_i[23]}]
set_max_fanout 4 [get_ports {hart_id_i[22]}]
set_max_fanout 4 [get_ports {hart_id_i[21]}]
set_max_fanout 4 [get_ports {hart_id_i[20]}]
set_max_fanout 4 [get_ports {hart_id_i[19]}]
set_max_fanout 4 [get_ports {hart_id_i[18]}]
set_max_fanout 4 [get_ports {hart_id_i[17]}]
set_max_fanout 4 [get_ports {hart_id_i[16]}]
set_max_fanout 4 [get_ports {hart_id_i[15]}]
set_max_fanout 4 [get_ports {hart_id_i[14]}]
set_max_fanout 4 [get_ports {hart_id_i[13]}]
set_max_fanout 4 [get_ports {hart_id_i[12]}]
set_max_fanout 4 [get_ports {hart_id_i[11]}]
set_max_fanout 4 [get_ports {hart_id_i[10]}]
set_max_fanout 4 [get_ports {hart_id_i[9]}]
set_max_fanout 4 [get_ports {hart_id_i[8]}]
set_max_fanout 4 [get_ports {hart_id_i[7]}]
set_max_fanout 4 [get_ports {hart_id_i[6]}]
set_max_fanout 4 [get_ports {hart_id_i[5]}]
set_max_fanout 4 [get_ports {hart_id_i[4]}]
set_max_fanout 4 [get_ports {hart_id_i[3]}]
set_max_fanout 4 [get_ports {hart_id_i[2]}]
set_max_fanout 4 [get_ports {hart_id_i[1]}]
set_max_fanout 4 [get_ports {hart_id_i[0]}]
set_max_fanout 4 [get_ports {boot_addr_i[31]}]
set_max_fanout 4 [get_ports {boot_addr_i[30]}]
set_max_fanout 4 [get_ports {boot_addr_i[29]}]
set_max_fanout 4 [get_ports {boot_addr_i[28]}]
set_max_fanout 4 [get_ports {boot_addr_i[27]}]
set_max_fanout 4 [get_ports {boot_addr_i[26]}]
set_max_fanout 4 [get_ports {boot_addr_i[25]}]
set_max_fanout 4 [get_ports {boot_addr_i[24]}]
set_max_fanout 4 [get_ports {boot_addr_i[23]}]
set_max_fanout 4 [get_ports {boot_addr_i[22]}]
set_max_fanout 4 [get_ports {boot_addr_i[21]}]
set_max_fanout 4 [get_ports {boot_addr_i[20]}]
set_max_fanout 4 [get_ports {boot_addr_i[19]}]
set_max_fanout 4 [get_ports {boot_addr_i[18]}]
set_max_fanout 4 [get_ports {boot_addr_i[17]}]
set_max_fanout 4 [get_ports {boot_addr_i[16]}]
set_max_fanout 4 [get_ports {boot_addr_i[15]}]
set_max_fanout 4 [get_ports {boot_addr_i[14]}]
set_max_fanout 4 [get_ports {boot_addr_i[13]}]
set_max_fanout 4 [get_ports {boot_addr_i[12]}]
set_max_fanout 4 [get_ports {boot_addr_i[11]}]
set_max_fanout 4 [get_ports {boot_addr_i[10]}]
set_max_fanout 4 [get_ports {boot_addr_i[9]}]
set_max_fanout 4 [get_ports {boot_addr_i[8]}]
set_max_fanout 4 [get_ports {boot_addr_i[7]}]
set_max_fanout 4 [get_ports {boot_addr_i[6]}]
set_max_fanout 4 [get_ports {boot_addr_i[5]}]
set_max_fanout 4 [get_ports {boot_addr_i[4]}]
set_max_fanout 4 [get_ports {boot_addr_i[3]}]
set_max_fanout 4 [get_ports {boot_addr_i[2]}]
set_max_fanout 4 [get_ports {boot_addr_i[1]}]
set_max_fanout 4 [get_ports {boot_addr_i[0]}]
set_max_fanout 4 [get_ports instr_gnt_i]
set_max_fanout 4 [get_ports instr_rvalid_i]
set_max_fanout 4 [get_ports {instr_rdata_i[31]}]
set_max_fanout 4 [get_ports {instr_rdata_i[30]}]
set_max_fanout 4 [get_ports {instr_rdata_i[29]}]
set_max_fanout 4 [get_ports {instr_rdata_i[28]}]
set_max_fanout 4 [get_ports {instr_rdata_i[27]}]
set_max_fanout 4 [get_ports {instr_rdata_i[26]}]
set_max_fanout 4 [get_ports {instr_rdata_i[25]}]
set_max_fanout 4 [get_ports {instr_rdata_i[24]}]
set_max_fanout 4 [get_ports {instr_rdata_i[23]}]
set_max_fanout 4 [get_ports {instr_rdata_i[22]}]
set_max_fanout 4 [get_ports {instr_rdata_i[21]}]
set_max_fanout 4 [get_ports {instr_rdata_i[20]}]
set_max_fanout 4 [get_ports {instr_rdata_i[19]}]
set_max_fanout 4 [get_ports {instr_rdata_i[18]}]
set_max_fanout 4 [get_ports {instr_rdata_i[17]}]
set_max_fanout 4 [get_ports {instr_rdata_i[16]}]
set_max_fanout 4 [get_ports {instr_rdata_i[15]}]
set_max_fanout 4 [get_ports {instr_rdata_i[14]}]
set_max_fanout 4 [get_ports {instr_rdata_i[13]}]
set_max_fanout 4 [get_ports {instr_rdata_i[12]}]
set_max_fanout 4 [get_ports {instr_rdata_i[11]}]
set_max_fanout 4 [get_ports {instr_rdata_i[10]}]
set_max_fanout 4 [get_ports {instr_rdata_i[9]}]
set_max_fanout 4 [get_ports {instr_rdata_i[8]}]
set_max_fanout 4 [get_ports {instr_rdata_i[7]}]
set_max_fanout 4 [get_ports {instr_rdata_i[6]}]
set_max_fanout 4 [get_ports {instr_rdata_i[5]}]
set_max_fanout 4 [get_ports {instr_rdata_i[4]}]
set_max_fanout 4 [get_ports {instr_rdata_i[3]}]
set_max_fanout 4 [get_ports {instr_rdata_i[2]}]
set_max_fanout 4 [get_ports {instr_rdata_i[1]}]
set_max_fanout 4 [get_ports {instr_rdata_i[0]}]
set_max_fanout 4 [get_ports {instr_rdata_intg_i[6]}]
set_max_fanout 4 [get_ports {instr_rdata_intg_i[5]}]
set_max_fanout 4 [get_ports {instr_rdata_intg_i[4]}]
set_max_fanout 4 [get_ports {instr_rdata_intg_i[3]}]
set_max_fanout 4 [get_ports {instr_rdata_intg_i[2]}]
set_max_fanout 4 [get_ports {instr_rdata_intg_i[1]}]
set_max_fanout 4 [get_ports {instr_rdata_intg_i[0]}]
set_max_fanout 4 [get_ports instr_err_i]
set_max_fanout 4 [get_ports data_gnt_i]
set_max_fanout 4 [get_ports data_rvalid_i]
set_max_fanout 4 [get_ports {data_rdata_i[31]}]
set_max_fanout 4 [get_ports {data_rdata_i[30]}]
set_max_fanout 4 [get_ports {data_rdata_i[29]}]
set_max_fanout 4 [get_ports {data_rdata_i[28]}]
set_max_fanout 4 [get_ports {data_rdata_i[27]}]
set_max_fanout 4 [get_ports {data_rdata_i[26]}]
set_max_fanout 4 [get_ports {data_rdata_i[25]}]
set_max_fanout 4 [get_ports {data_rdata_i[24]}]
set_max_fanout 4 [get_ports {data_rdata_i[23]}]
set_max_fanout 4 [get_ports {data_rdata_i[22]}]
set_max_fanout 4 [get_ports {data_rdata_i[21]}]
set_max_fanout 4 [get_ports {data_rdata_i[20]}]
set_max_fanout 4 [get_ports {data_rdata_i[19]}]
set_max_fanout 4 [get_ports {data_rdata_i[18]}]
set_max_fanout 4 [get_ports {data_rdata_i[17]}]
set_max_fanout 4 [get_ports {data_rdata_i[16]}]
set_max_fanout 4 [get_ports {data_rdata_i[15]}]
set_max_fanout 4 [get_ports {data_rdata_i[14]}]
set_max_fanout 4 [get_ports {data_rdata_i[13]}]
set_max_fanout 4 [get_ports {data_rdata_i[12]}]
set_max_fanout 4 [get_ports {data_rdata_i[11]}]
set_max_fanout 4 [get_ports {data_rdata_i[10]}]
set_max_fanout 4 [get_ports {data_rdata_i[9]}]
set_max_fanout 4 [get_ports {data_rdata_i[8]}]
set_max_fanout 4 [get_ports {data_rdata_i[7]}]
set_max_fanout 4 [get_ports {data_rdata_i[6]}]
set_max_fanout 4 [get_ports {data_rdata_i[5]}]
set_max_fanout 4 [get_ports {data_rdata_i[4]}]
set_max_fanout 4 [get_ports {data_rdata_i[3]}]
set_max_fanout 4 [get_ports {data_rdata_i[2]}]
set_max_fanout 4 [get_ports {data_rdata_i[1]}]
set_max_fanout 4 [get_ports {data_rdata_i[0]}]
set_max_fanout 4 [get_ports {data_rdata_intg_i[6]}]
set_max_fanout 4 [get_ports {data_rdata_intg_i[5]}]
set_max_fanout 4 [get_ports {data_rdata_intg_i[4]}]
set_max_fanout 4 [get_ports {data_rdata_intg_i[3]}]
set_max_fanout 4 [get_ports {data_rdata_intg_i[2]}]
set_max_fanout 4 [get_ports {data_rdata_intg_i[1]}]
set_max_fanout 4 [get_ports {data_rdata_intg_i[0]}]
set_max_fanout 4 [get_ports data_err_i]
set_max_fanout 4 [get_ports irq_software_i]
set_max_fanout 4 [get_ports irq_timer_i]
set_max_fanout 4 [get_ports irq_external_i]
set_max_fanout 4 [get_ports {irq_fast_i[14]}]
set_max_fanout 4 [get_ports {irq_fast_i[13]}]
set_max_fanout 4 [get_ports {irq_fast_i[12]}]
set_max_fanout 4 [get_ports {irq_fast_i[11]}]
set_max_fanout 4 [get_ports {irq_fast_i[10]}]
set_max_fanout 4 [get_ports {irq_fast_i[9]}]
set_max_fanout 4 [get_ports {irq_fast_i[8]}]
set_max_fanout 4 [get_ports {irq_fast_i[7]}]
set_max_fanout 4 [get_ports {irq_fast_i[6]}]
set_max_fanout 4 [get_ports {irq_fast_i[5]}]
set_max_fanout 4 [get_ports {irq_fast_i[4]}]
set_max_fanout 4 [get_ports {irq_fast_i[3]}]
set_max_fanout 4 [get_ports {irq_fast_i[2]}]
set_max_fanout 4 [get_ports {irq_fast_i[1]}]
set_max_fanout 4 [get_ports {irq_fast_i[0]}]
set_max_fanout 4 [get_ports irq_nm_i]
set_max_fanout 4 [get_ports scramble_key_valid_i]
set_max_fanout 4 [get_ports {scramble_key_i[127]}]
set_max_fanout 4 [get_ports {scramble_key_i[126]}]
set_max_fanout 4 [get_ports {scramble_key_i[125]}]
set_max_fanout 4 [get_ports {scramble_key_i[124]}]
set_max_fanout 4 [get_ports {scramble_key_i[123]}]
set_max_fanout 4 [get_ports {scramble_key_i[122]}]
set_max_fanout 4 [get_ports {scramble_key_i[121]}]
set_max_fanout 4 [get_ports {scramble_key_i[120]}]
set_max_fanout 4 [get_ports {scramble_key_i[119]}]
set_max_fanout 4 [get_ports {scramble_key_i[118]}]
set_max_fanout 4 [get_ports {scramble_key_i[117]}]
set_max_fanout 4 [get_ports {scramble_key_i[116]}]
set_max_fanout 4 [get_ports {scramble_key_i[115]}]
set_max_fanout 4 [get_ports {scramble_key_i[114]}]
set_max_fanout 4 [get_ports {scramble_key_i[113]}]
set_max_fanout 4 [get_ports {scramble_key_i[112]}]
set_max_fanout 4 [get_ports {scramble_key_i[111]}]
set_max_fanout 4 [get_ports {scramble_key_i[110]}]
set_max_fanout 4 [get_ports {scramble_key_i[109]}]
set_max_fanout 4 [get_ports {scramble_key_i[108]}]
set_max_fanout 4 [get_ports {scramble_key_i[107]}]
set_max_fanout 4 [get_ports {scramble_key_i[106]}]
set_max_fanout 4 [get_ports {scramble_key_i[105]}]
set_max_fanout 4 [get_ports {scramble_key_i[104]}]
set_max_fanout 4 [get_ports {scramble_key_i[103]}]
set_max_fanout 4 [get_ports {scramble_key_i[102]}]
set_max_fanout 4 [get_ports {scramble_key_i[101]}]
set_max_fanout 4 [get_ports {scramble_key_i[100]}]
set_max_fanout 4 [get_ports {scramble_key_i[99]}]
set_max_fanout 4 [get_ports {scramble_key_i[98]}]
set_max_fanout 4 [get_ports {scramble_key_i[97]}]
set_max_fanout 4 [get_ports {scramble_key_i[96]}]
set_max_fanout 4 [get_ports {scramble_key_i[95]}]
set_max_fanout 4 [get_ports {scramble_key_i[94]}]
set_max_fanout 4 [get_ports {scramble_key_i[93]}]
set_max_fanout 4 [get_ports {scramble_key_i[92]}]
set_max_fanout 4 [get_ports {scramble_key_i[91]}]
set_max_fanout 4 [get_ports {scramble_key_i[90]}]
set_max_fanout 4 [get_ports {scramble_key_i[89]}]
set_max_fanout 4 [get_ports {scramble_key_i[88]}]
set_max_fanout 4 [get_ports {scramble_key_i[87]}]
set_max_fanout 4 [get_ports {scramble_key_i[86]}]
set_max_fanout 4 [get_ports {scramble_key_i[85]}]
set_max_fanout 4 [get_ports {scramble_key_i[84]}]
set_max_fanout 4 [get_ports {scramble_key_i[83]}]
set_max_fanout 4 [get_ports {scramble_key_i[82]}]
set_max_fanout 4 [get_ports {scramble_key_i[81]}]
set_max_fanout 4 [get_ports {scramble_key_i[80]}]
set_max_fanout 4 [get_ports {scramble_key_i[79]}]
set_max_fanout 4 [get_ports {scramble_key_i[78]}]
set_max_fanout 4 [get_ports {scramble_key_i[77]}]
set_max_fanout 4 [get_ports {scramble_key_i[76]}]
set_max_fanout 4 [get_ports {scramble_key_i[75]}]
set_max_fanout 4 [get_ports {scramble_key_i[74]}]
set_max_fanout 4 [get_ports {scramble_key_i[73]}]
set_max_fanout 4 [get_ports {scramble_key_i[72]}]
set_max_fanout 4 [get_ports {scramble_key_i[71]}]
set_max_fanout 4 [get_ports {scramble_key_i[70]}]
set_max_fanout 4 [get_ports {scramble_key_i[69]}]
set_max_fanout 4 [get_ports {scramble_key_i[68]}]
set_max_fanout 4 [get_ports {scramble_key_i[67]}]
set_max_fanout 4 [get_ports {scramble_key_i[66]}]
set_max_fanout 4 [get_ports {scramble_key_i[65]}]
set_max_fanout 4 [get_ports {scramble_key_i[64]}]
set_max_fanout 4 [get_ports {scramble_key_i[63]}]
set_max_fanout 4 [get_ports {scramble_key_i[62]}]
set_max_fanout 4 [get_ports {scramble_key_i[61]}]
set_max_fanout 4 [get_ports {scramble_key_i[60]}]
set_max_fanout 4 [get_ports {scramble_key_i[59]}]
set_max_fanout 4 [get_ports {scramble_key_i[58]}]
set_max_fanout 4 [get_ports {scramble_key_i[57]}]
set_max_fanout 4 [get_ports {scramble_key_i[56]}]
set_max_fanout 4 [get_ports {scramble_key_i[55]}]
set_max_fanout 4 [get_ports {scramble_key_i[54]}]
set_max_fanout 4 [get_ports {scramble_key_i[53]}]
set_max_fanout 4 [get_ports {scramble_key_i[52]}]
set_max_fanout 4 [get_ports {scramble_key_i[51]}]
set_max_fanout 4 [get_ports {scramble_key_i[50]}]
set_max_fanout 4 [get_ports {scramble_key_i[49]}]
set_max_fanout 4 [get_ports {scramble_key_i[48]}]
set_max_fanout 4 [get_ports {scramble_key_i[47]}]
set_max_fanout 4 [get_ports {scramble_key_i[46]}]
set_max_fanout 4 [get_ports {scramble_key_i[45]}]
set_max_fanout 4 [get_ports {scramble_key_i[44]}]
set_max_fanout 4 [get_ports {scramble_key_i[43]}]
set_max_fanout 4 [get_ports {scramble_key_i[42]}]
set_max_fanout 4 [get_ports {scramble_key_i[41]}]
set_max_fanout 4 [get_ports {scramble_key_i[40]}]
set_max_fanout 4 [get_ports {scramble_key_i[39]}]
set_max_fanout 4 [get_ports {scramble_key_i[38]}]
set_max_fanout 4 [get_ports {scramble_key_i[37]}]
set_max_fanout 4 [get_ports {scramble_key_i[36]}]
set_max_fanout 4 [get_ports {scramble_key_i[35]}]
set_max_fanout 4 [get_ports {scramble_key_i[34]}]
set_max_fanout 4 [get_ports {scramble_key_i[33]}]
set_max_fanout 4 [get_ports {scramble_key_i[32]}]
set_max_fanout 4 [get_ports {scramble_key_i[31]}]
set_max_fanout 4 [get_ports {scramble_key_i[30]}]
set_max_fanout 4 [get_ports {scramble_key_i[29]}]
set_max_fanout 4 [get_ports {scramble_key_i[28]}]
set_max_fanout 4 [get_ports {scramble_key_i[27]}]
set_max_fanout 4 [get_ports {scramble_key_i[26]}]
set_max_fanout 4 [get_ports {scramble_key_i[25]}]
set_max_fanout 4 [get_ports {scramble_key_i[24]}]
set_max_fanout 4 [get_ports {scramble_key_i[23]}]
set_max_fanout 4 [get_ports {scramble_key_i[22]}]
set_max_fanout 4 [get_ports {scramble_key_i[21]}]
set_max_fanout 4 [get_ports {scramble_key_i[20]}]
set_max_fanout 4 [get_ports {scramble_key_i[19]}]
set_max_fanout 4 [get_ports {scramble_key_i[18]}]
set_max_fanout 4 [get_ports {scramble_key_i[17]}]
set_max_fanout 4 [get_ports {scramble_key_i[16]}]
set_max_fanout 4 [get_ports {scramble_key_i[15]}]
set_max_fanout 4 [get_ports {scramble_key_i[14]}]
set_max_fanout 4 [get_ports {scramble_key_i[13]}]
set_max_fanout 4 [get_ports {scramble_key_i[12]}]
set_max_fanout 4 [get_ports {scramble_key_i[11]}]
set_max_fanout 4 [get_ports {scramble_key_i[10]}]
set_max_fanout 4 [get_ports {scramble_key_i[9]}]
set_max_fanout 4 [get_ports {scramble_key_i[8]}]
set_max_fanout 4 [get_ports {scramble_key_i[7]}]
set_max_fanout 4 [get_ports {scramble_key_i[6]}]
set_max_fanout 4 [get_ports {scramble_key_i[5]}]
set_max_fanout 4 [get_ports {scramble_key_i[4]}]
set_max_fanout 4 [get_ports {scramble_key_i[3]}]
set_max_fanout 4 [get_ports {scramble_key_i[2]}]
set_max_fanout 4 [get_ports {scramble_key_i[1]}]
set_max_fanout 4 [get_ports {scramble_key_i[0]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[63]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[62]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[61]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[60]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[59]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[58]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[57]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[56]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[55]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[54]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[53]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[52]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[51]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[50]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[49]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[48]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[47]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[46]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[45]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[44]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[43]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[42]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[41]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[40]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[39]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[38]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[37]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[36]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[35]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[34]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[33]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[32]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[31]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[30]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[29]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[28]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[27]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[26]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[25]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[24]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[23]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[22]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[21]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[20]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[19]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[18]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[17]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[16]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[15]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[14]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[13]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[12]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[11]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[10]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[9]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[8]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[7]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[6]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[5]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[4]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[3]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[2]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[1]}]
set_max_fanout 4 [get_ports {scramble_nonce_i[0]}]
set_max_fanout 4 [get_ports debug_req_i]
set_max_fanout 4 [get_ports {fetch_enable_i[3]}]
set_max_fanout 4 [get_ports {fetch_enable_i[2]}]
set_max_fanout 4 [get_ports {fetch_enable_i[1]}]
set_max_fanout 4 [get_ports {fetch_enable_i[0]}]
set_max_fanout 4 [get_ports scan_rst_ni]
