###############################################################
#  Generated by:      Cadence Innovus 19.10-p002_1
#  OS:                Linux x86_64(Host ID remote02)
#  Generated on:      Fri May 29 12:59:44 2020
#  Design:            mult8x8
#  Command:           saveDesign mult8x8.clock.enc
###############################################################
current_design mult8x8
create_clock [get_ports {clk}]  -name clk -period 2.000000 -waveform {0.000000 1.000000}
set_clock_transition  -rise -min 0.01 [get_clocks {clk}]
set_clock_transition  -rise -max 0.01 [get_clocks {clk}]
set_clock_transition  -fall -min 0.01 [get_clocks {clk}]
set_clock_transition  -fall -max 0.01 [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_driving_cell -lib_cell INVX1TS -rise -min [get_ports {clk}]
set_driving_cell -lib_cell INVX1TS -fall -min [get_ports {clk}]
set_driving_cell -lib_cell INVX1TS -rise -max [get_ports {clk}]
set_driving_cell -lib_cell INVX1TS -fall -max [get_ports {clk}]
set_max_capacitance 0.005  [get_ports {clk}]
set_max_fanout 4  [get_ports {clk}]
set_driving_cell -lib_cell INVX1TS -rise -min [get_ports {resetn}]
set_driving_cell -lib_cell INVX1TS -fall -min [get_ports {resetn}]
set_driving_cell -lib_cell INVX1TS -rise -max [get_ports {resetn}]
set_driving_cell -lib_cell INVX1TS -fall -max [get_ports {resetn}]
set_max_capacitance 0.005  [get_ports {resetn}]
set_max_fanout 4  [get_ports {resetn}]
set_driving_cell -lib_cell INVX1TS -rise -min [get_ports {a[7]}]
set_driving_cell -lib_cell INVX1TS -fall -min [get_ports {a[7]}]
set_driving_cell -lib_cell INVX1TS -rise -max [get_ports {a[7]}]
set_driving_cell -lib_cell INVX1TS -fall -max [get_ports {a[7]}]
set_max_capacitance 0.005  [get_ports {a[7]}]
set_max_fanout 4  [get_ports {a[7]}]
set_driving_cell -lib_cell INVX1TS -rise -min [get_ports {a[6]}]
set_driving_cell -lib_cell INVX1TS -fall -min [get_ports {a[6]}]
set_driving_cell -lib_cell INVX1TS -rise -max [get_ports {a[6]}]
set_driving_cell -lib_cell INVX1TS -fall -max [get_ports {a[6]}]
set_max_capacitance 0.005  [get_ports {a[6]}]
set_max_fanout 4  [get_ports {a[6]}]
set_driving_cell -lib_cell INVX1TS -rise -min [get_ports {a[5]}]
set_driving_cell -lib_cell INVX1TS -fall -min [get_ports {a[5]}]
set_driving_cell -lib_cell INVX1TS -rise -max [get_ports {a[5]}]
set_driving_cell -lib_cell INVX1TS -fall -max [get_ports {a[5]}]
set_max_capacitance 0.005  [get_ports {a[5]}]
set_max_fanout 4  [get_ports {a[5]}]
set_driving_cell -lib_cell INVX1TS -rise -min [get_ports {a[4]}]
set_driving_cell -lib_cell INVX1TS -fall -min [get_ports {a[4]}]
set_driving_cell -lib_cell INVX1TS -rise -max [get_ports {a[4]}]
set_driving_cell -lib_cell INVX1TS -fall -max [get_ports {a[4]}]
set_max_capacitance 0.005  [get_ports {a[4]}]
set_max_fanout 4  [get_ports {a[4]}]
set_driving_cell -lib_cell INVX1TS -rise -min [get_ports {a[3]}]
set_driving_cell -lib_cell INVX1TS -fall -min [get_ports {a[3]}]
set_driving_cell -lib_cell INVX1TS -rise -max [get_ports {a[3]}]
set_driving_cell -lib_cell INVX1TS -fall -max [get_ports {a[3]}]
set_max_capacitance 0.005  [get_ports {a[3]}]
set_max_fanout 4  [get_ports {a[3]}]
set_driving_cell -lib_cell INVX1TS -rise -min [get_ports {a[2]}]
set_driving_cell -lib_cell INVX1TS -fall -min [get_ports {a[2]}]
set_driving_cell -lib_cell INVX1TS -rise -max [get_ports {a[2]}]
set_driving_cell -lib_cell INVX1TS -fall -max [get_ports {a[2]}]
set_max_capacitance 0.005  [get_ports {a[2]}]
set_max_fanout 4  [get_ports {a[2]}]
set_driving_cell -lib_cell INVX1TS -rise -min [get_ports {a[1]}]
set_driving_cell -lib_cell INVX1TS -fall -min [get_ports {a[1]}]
set_driving_cell -lib_cell INVX1TS -rise -max [get_ports {a[1]}]
set_driving_cell -lib_cell INVX1TS -fall -max [get_ports {a[1]}]
set_max_capacitance 0.005  [get_ports {a[1]}]
set_max_fanout 4  [get_ports {a[1]}]
set_driving_cell -lib_cell INVX1TS -rise -min [get_ports {a[0]}]
set_driving_cell -lib_cell INVX1TS -fall -min [get_ports {a[0]}]
set_driving_cell -lib_cell INVX1TS -rise -max [get_ports {a[0]}]
set_driving_cell -lib_cell INVX1TS -fall -max [get_ports {a[0]}]
set_max_capacitance 0.005  [get_ports {a[0]}]
set_max_fanout 4  [get_ports {a[0]}]
set_driving_cell -lib_cell INVX1TS -rise -min [get_ports {b[7]}]
set_driving_cell -lib_cell INVX1TS -fall -min [get_ports {b[7]}]
set_driving_cell -lib_cell INVX1TS -rise -max [get_ports {b[7]}]
set_driving_cell -lib_cell INVX1TS -fall -max [get_ports {b[7]}]
set_max_capacitance 0.005  [get_ports {b[7]}]
set_max_fanout 4  [get_ports {b[7]}]
set_driving_cell -lib_cell INVX1TS -rise -min [get_ports {b[6]}]
set_driving_cell -lib_cell INVX1TS -fall -min [get_ports {b[6]}]
set_driving_cell -lib_cell INVX1TS -rise -max [get_ports {b[6]}]
set_driving_cell -lib_cell INVX1TS -fall -max [get_ports {b[6]}]
set_max_capacitance 0.005  [get_ports {b[6]}]
set_max_fanout 4  [get_ports {b[6]}]
set_driving_cell -lib_cell INVX1TS -rise -min [get_ports {b[5]}]
set_driving_cell -lib_cell INVX1TS -fall -min [get_ports {b[5]}]
set_driving_cell -lib_cell INVX1TS -rise -max [get_ports {b[5]}]
set_driving_cell -lib_cell INVX1TS -fall -max [get_ports {b[5]}]
set_max_capacitance 0.005  [get_ports {b[5]}]
set_max_fanout 4  [get_ports {b[5]}]
set_driving_cell -lib_cell INVX1TS -rise -min [get_ports {b[4]}]
set_driving_cell -lib_cell INVX1TS -fall -min [get_ports {b[4]}]
set_driving_cell -lib_cell INVX1TS -rise -max [get_ports {b[4]}]
set_driving_cell -lib_cell INVX1TS -fall -max [get_ports {b[4]}]
set_max_capacitance 0.005  [get_ports {b[4]}]
set_max_fanout 4  [get_ports {b[4]}]
set_driving_cell -lib_cell INVX1TS -rise -min [get_ports {b[3]}]
set_driving_cell -lib_cell INVX1TS -fall -min [get_ports {b[3]}]
set_driving_cell -lib_cell INVX1TS -rise -max [get_ports {b[3]}]
set_driving_cell -lib_cell INVX1TS -fall -max [get_ports {b[3]}]
set_max_capacitance 0.005  [get_ports {b[3]}]
set_max_fanout 4  [get_ports {b[3]}]
set_driving_cell -lib_cell INVX1TS -rise -min [get_ports {b[2]}]
set_driving_cell -lib_cell INVX1TS -fall -min [get_ports {b[2]}]
set_driving_cell -lib_cell INVX1TS -rise -max [get_ports {b[2]}]
set_driving_cell -lib_cell INVX1TS -fall -max [get_ports {b[2]}]
set_max_capacitance 0.005  [get_ports {b[2]}]
set_max_fanout 4  [get_ports {b[2]}]
set_driving_cell -lib_cell INVX1TS -rise -min [get_ports {b[1]}]
set_driving_cell -lib_cell INVX1TS -fall -min [get_ports {b[1]}]
set_driving_cell -lib_cell INVX1TS -rise -max [get_ports {b[1]}]
set_driving_cell -lib_cell INVX1TS -fall -max [get_ports {b[1]}]
set_max_capacitance 0.005  [get_ports {b[1]}]
set_max_fanout 4  [get_ports {b[1]}]
set_driving_cell -lib_cell INVX1TS -rise -min [get_ports {b[0]}]
set_driving_cell -lib_cell INVX1TS -fall -min [get_ports {b[0]}]
set_driving_cell -lib_cell INVX1TS -rise -max [get_ports {b[0]}]
set_driving_cell -lib_cell INVX1TS -fall -max [get_ports {b[0]}]
set_max_capacitance 0.005  [get_ports {b[0]}]
set_max_fanout 4  [get_ports {b[0]}]
set_load -pin_load -max  0.005  [get_ports {result[15]}]
set_load -pin_load -min  0.005  [get_ports {result[15]}]
set_load -pin_load -max  0.005  [get_ports {result[14]}]
set_load -pin_load -min  0.005  [get_ports {result[14]}]
set_load -pin_load -max  0.005  [get_ports {result[13]}]
set_load -pin_load -min  0.005  [get_ports {result[13]}]
set_load -pin_load -max  0.005  [get_ports {result[12]}]
set_load -pin_load -min  0.005  [get_ports {result[12]}]
set_load -pin_load -max  0.005  [get_ports {result[11]}]
set_load -pin_load -min  0.005  [get_ports {result[11]}]
set_load -pin_load -max  0.005  [get_ports {result[10]}]
set_load -pin_load -min  0.005  [get_ports {result[10]}]
set_load -pin_load -max  0.005  [get_ports {result[9]}]
set_load -pin_load -min  0.005  [get_ports {result[9]}]
set_load -pin_load -max  0.005  [get_ports {result[8]}]
set_load -pin_load -min  0.005  [get_ports {result[8]}]
set_load -pin_load -max  0.005  [get_ports {result[7]}]
set_load -pin_load -min  0.005  [get_ports {result[7]}]
set_load -pin_load -max  0.005  [get_ports {result[6]}]
set_load -pin_load -min  0.005  [get_ports {result[6]}]
set_load -pin_load -max  0.005  [get_ports {result[5]}]
set_load -pin_load -min  0.005  [get_ports {result[5]}]
set_load -pin_load -max  0.005  [get_ports {result[4]}]
set_load -pin_load -min  0.005  [get_ports {result[4]}]
set_load -pin_load -max  0.005  [get_ports {result[3]}]
set_load -pin_load -min  0.005  [get_ports {result[3]}]
set_load -pin_load -max  0.005  [get_ports {result[2]}]
set_load -pin_load -min  0.005  [get_ports {result[2]}]
set_load -pin_load -max  0.005  [get_ports {result[1]}]
set_load -pin_load -min  0.005  [get_ports {result[1]}]
set_load -pin_load -max  0.005  [get_ports {result[0]}]
set_load -pin_load -min  0.005  [get_ports {result[0]}]
set_max_fanout 4  [get_designs {mult8x8}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[4]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[2]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[0]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[7]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[5]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[3]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[1]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[7]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {resetn}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[5]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[3]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[1]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[6]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[4]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[2]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {a[0]}]
set_input_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {b[6]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {result[8]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {result[6]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {result[4]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {result[2]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {result[14]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {result[0]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {result[12]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {result[10]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {result[9]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {result[7]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {result[5]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {result[3]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {result[15]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {result[1]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {result[13]}]
set_output_delay -add_delay 0.1 -clock [get_clocks {clk}] [get_ports {result[11]}]
set_clock_uncertainty 0.01 [get_clocks {clk}]
set_ideal_network  [get_ports {clk}]
